Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 9, 9, 3)]         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 9, 9, 64)          1792      
_________________________________________________________________
batch_normalization (BatchNo (None, 9, 9, 64)          256       
_________________________________________________________________
activation (Activation)      (None, 9, 9, 64)          0         
_________________________________________________________________
conv2 (Conv2D)               (None, 9, 9, 64)          36928     
_________________________________________________________________
batch_normalization_1 (Batch (None, 9, 9, 64)          256       
_________________________________________________________________
activation_1 (Activation)    (None, 9, 9, 64)          0         
_________________________________________________________________
primarycap_conv2d (Conv2D)   (None, 1, 1, 256)         1327360   
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 1, 256)         1024      
_________________________________________________________________
primarycap_reshape (Reshape) (None, 32, 8)             0         
_________________________________________________________________
primarycap_squash (Lambda)   (None, 32, 8)             0         
_________________________________________________________________
digitcaps (CapsuleLayer)     (None, 6, 6, 32, 16)      24576     
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               9437696   
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              525312    
_________________________________________________________________
dense_2 (Dense)              (None, 243)               249075    
_________________________________________________________________
reshape (Reshape)            (None, 9, 9, 3)           0         
=================================================================
Total params: 11,604,275
Trainable params: 11,603,507
Non-trainable params: 768
_________________________________________________________________
